# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных индексы элементы 3 и 9, ответ: 12

white_wood = [2, 3, 5, 9, 3]
sum = 0
for i in range(len(white_wood)):
    if i % 2 == 1:
        sum += white_wood[i]
print(sum)



