# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу
# между максимальным и минимальным значением дробной части элементов.

# Пример:

# - [1.1, 1.2, 3.1, 10.01] => 0.19
my_list = ["1", "2", "3", "4"]
hello = int(my_list)
print(max(hello), min(hello))