# Напишите программу, которая будет преобразовывать десятичное число в двоичное (без встроенных функций).

# Пример:

# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

temp = ""
num = int(input("Введите число для преобразовывания десятичного числа в двоичное:\n"))
while n != 0:
    temp = str(num%2) + temp
    num //=2
print(temp)